---
kind: enumMember
id: F:Autodesk.Revit.DB.AdaptivePointConstraintType.Axis_Z
enum: Autodesk.Revit.DB.AdaptivePointConstraintType
source: html/9aa479aa-36be-bf1b-7570-026afcd4d02e.htm
---
# Autodesk.Revit.DB.AdaptivePointConstraintType.Axis_Z

Constrained to the Z Axis (x=0, y=0).